import Foundation

enum Exchange:Int {
    case BITHUMB = 0
    case COINONE = 1
    case UPBIT = 2
    case COINNEST = 3
    
    static var count: Int {return Exchange.COINNEST.hashValue + 1}
}


struct Resource {
    static let EXCHANGE:[String] = ["빗썸-Bithumb", "코인원-Coinone", "코인네스트-Coinnest", "업비트-Upbit"]
    static let Data:[String: [String]] = [
        "빗썸" : ["비트코인", "리플", "이더리움", "비트코인 캐시", "라이트코인", "대시", "모네로", "이오스", "퀀텀", "비트코인 골드", "이더리움 클래식", "재트캐시"],
        "코인원" : ["비트코인", "리플", "이더리움", "비트코인 캐시", "IOTA", "모네로", "퀀텀", "비트코인 골드", "이더리움 클래식"],
        "코인네스트" : ["윌튼","카이버","에이치쉐어","비트코인", "ENTCash", "lnk","모나코","리플", "이더리움", "카르다노", "트론", "OmiseGO","에너고","네오","비트코인다이아","NeoGas","비트코인 캐시","퀀텀", "비트코인 골드", "이더리움 클래식"],
        "업비트" : ["비트코인", "리플", "이더리움", "에이다","비트코인 캐시", "라이트코인", "스테이터스네트워크토큰", "머큐리", "대시", "모네로", "이오스", "퀀텀", "네오","비트코인 골드","아더","스팀","아인스타이늄","스팀달러", "스텔라루멘", "뉴이코노미무브먼트","파워렛저","블록틱스", "스토리지", "스트라티스","그로스톨코인", "오미세고", "코모도", "어거","웨이브", "아크","리스크", "피벡스","버트코인","메탈","이더리움 클래식", "재트캐시"]
    ]
}
